Repository: RayanceKing/CCZUHelper
Catalog: CCZUHelper/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# competition.summary.instructions
source: Summarize the competition notice in concise Chinese within 120 words.
ja: コンテスト通知を120語以内で簡潔に要約してください。
ko: 대회 공지를 120단어 이내로 간결하게 요약하세요.
zh_hans: 请将竞赛通知总结为不超过120字的简洁中文。
zh_hant: 請將競賽通知總結為不超過120字的簡潔中文。

# competition.summary.prompt
source: Title: %@\n\nContent: %@\n\nPlease summarize key points, eligibility, deadlines, and submission requirements in no more than 150 words.
ja: タイトル：%@\n\n本文：%@\n\n要点、応募条件、締切、提出要件を中心に150語以内で要約してください。
ko: 제목: %@\n\n본문: %@\n\n핵심 정보, 지원 자격, 마감일, 제출 요건을 중심으로 150단어 이내로 요약해 주세요.
zh_hans: 标题：%@\n\n正文：%@\n\n请提炼关键信息、报名条件、截止时间与提交要求，生成不超过150字的总结。
zh_hant: 標題：%@\n\n正文：%@\n\n請提煉關鍵資訊、報名條件、截止時間與提交要求，生成不超過150字的總結。

# competition.summary.fallback_prefix
source: (Preview)\n\n
ja: （プレビュー）\n\n
ko: (미리보기)\n\n
zh_hans: （预览）\n\n
zh_hant: （預覽）\n\n

# competition.summary.unsupported_system
source: Summary is not supported on this system version
ja: このシステムバージョンでは要約機能をサポートしていません
ko: 현재 시스템 버전에서는 요약 기능을 지원하지 않습니다
zh_hans: 当前系统版本不支持总结功能
zh_hant: 目前系統版本不支援總結功能

source: Calendar Permission Error
ko: 캘린더 권한 이상
zh_hans: 日历权限异常
zh_hant: 日歷權限异常

# classroom.building.a
source: Building A
ko: 강의동A
zh_hans: 教学楼A
zh_hant: 教學樓A

# classroom.building.b
source: Building B
ko: 강의동B
zh_hans: 教学楼B
zh_hant: 教學樓B

# classroom.building.c
source: Building C
ko: 강의동C
zh_hans: 教学楼C
zh_hant: 教學樓C

# classroom.building.d
source: Lab Building D
ko: 실험동D
zh_hans: 实验楼D
zh_hant: 實驗樓D

# classroom.weekday.friday
source: Fri
ko: 주五
zh_hans: 周五
zh_hant: 週五

# classroom.weekday.monday
source: Mon
ko: 주一
zh_hans: 周一
zh_hant: 週一

# classroom.weekday.saturday
source: Sat
ko: 주六
zh_hans: 周六
zh_hant: 週六

# classroom.weekday.sunday
source: Sun
ko: 주日
zh_hans: 周日
zh_hant: 週日

# classroom.weekday.thursday
source: Thu
ko: 주四
zh_hans: 周四
zh_hant: 週四

# classroom.weekday.tuesday
source: Tue
ko: 주二
zh_hans: 周二
zh_hant: 週二

# classroom.weekday.wednesday
source: Wed
ko: 주三
zh_hans: 周三
zh_hant: 週三

# comment.delete_confirm
source: Are you sure you want to delete this comment?
ko: 이 댓글을 정말로 삭제하시겠습니까?
zh_hans: 确定要删除这条评论吗？
zh_hant: 確定要刪除这条評論吗？

# common.ok
source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定

# common.save
source: Save
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# course_selection.submit
source: Submit Selection
ko: 제출选课
zh_hans: 提交选课
zh_hant: 提交選課

# date_picker.title
source: Select Date
ko: 选择날짜
zh_hans: 选择日期
zh_hant: 選擇日期

# electricity.add_config
source: Add Configuration
ko: 추가配置
zh_hans: 添加配置
zh_hant: 添加配置

# electricity.delete_confirm
source: Confirm Delete
ko: 확인삭제
zh_hans: 确认删除
zh_hant: 確認刪除

# evaluation.submit
source: Submit Evaluation
ko: 제출评价
zh_hans: 提交评价
zh_hant: 提交評價

# evaluation.success
source: Success!
ko: 评价성공！
zh_hans: 评价成功！
zh_hant: 評價成功！

source: Exam List
ko: 시험列表
zh_hans: 考试列表
zh_hant: 考試列表

# exam.total_count
source: Total Exams
ko: 시험总数
zh_hans: 考试总数
zh_hant: 考試總數

# forget.confirm_password.placeholder
source: Confirm New Password
ko: 확인新密码
zh_hans: 确认新密码
zh_hant: 確認新密碼

# forget.set_password
source: Set New Password
ko: 설정新密码
zh_hans: 设置新密码
zh_hant: 設置新密碼

# gpa.error.no_info
source: No GPA information found
ko: 未검색到学分GPA信息
zh_hans: 未查询到学分绩点信息
zh_hant: 未查詢到學分績點信息

# grade.no_grades
source: No Grades
ko: 暂无성적
zh_hans: 暂无成绩
zh_hant: 暂无成績

# grade.search_course
source: Search Subject
ko: 검색科目
zh_hans: 搜索科目
zh_hant: 搜索科目

# image.picker.select
source: Select Image
ko: 选择이미지
zh_hans: 选择图片
zh_hant: 選擇圖片

# image.picker.title
source: Select Background Image
ko: 选择背景이미지
zh_hans: 选择背景图片
zh_hant: 選擇背景圖片

# import_schedule.add_demo
source: Add Demo Schedule
ko: 추가示例课表
zh_hans: 添加示例课表
zh_hant: 添加示例課表

# location_reminder
source: Location: %@
ko: 장소
zh_hans: 上课地点：%@
zh_hant: 上課地點：%@

# manage_schedules.delete_confirm_title
source: Delete Schedule
ko: 삭제课表
zh_hans: 删除课表
zh_hant: 刪除課表

# report.error.title
source: Report Failed
ko: 举报실패
zh_hans: 举报失败
zh_hant: 舉報失敗

# report.reason.pornography
source: Pornographic Content
ko: 色情내용
zh_hans: 色情内容
zh_hant: 色情內容

# report.reason.violence
source: Violent Content
ko: 暴力내용
zh_hans: 暴力内容
zh_hant: 暴力內容

# report.submit
source: Submit Report
ko: 제출举报
zh_hans: 提交举报
zh_hant: 提交舉報

# report.title
source: Report Post
ko: 举报게시물
zh_hans: 举报帖子
zh_hant: 舉報帖子

source: Save
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# schedule_component.select_date
source: Select Date
ko: 选择날짜
zh_hans: 选择日期
zh_hant: 選擇日期

# schedule_component.weeks_not_set
source: Not set
ko: 未설정
zh_hans: 未设置
zh_hant: 未設置

# schedule.today
source: Today
ko: 오늘
zh_hans: 今日
zh_hant: 今日

# settings.appearance_settings
source: Appearance
ko: 外观설정
zh_hans: 外观设置
zh_hant: 外觀設置

# settings.background_image
source: Enable Background Image
ko: 开启背景이미지
zh_hans: 开启背景图片
zh_hant: 開啟背景圖片

# settings.enable_exam_notification
source: Enable Exam Notifications
ko: 开启시험通知
zh_hans: 开启考试通知
zh_hant: 開啟考試通知

# settings.exam_notification
source: Exam Notifications
ko: 시험通知
zh_hans: 考试通知
zh_hant: 考試通知

# settings.icloud_data_sync
source: iCloud Data Sync
ko: 동기화
zh_hans: iCloud 数据同步
zh_hant: iCloud 數據同步

# training_plan.semester
source: Semester
ko: 학기
zh_hans: 学期
zh_hant: 學期

# training_plan.semester_total
source: Semester Total
ko: 학기总计
zh_hans: 学期总计
zh_hant: 學期總計

# training_plan.years_format
source: %lld years
ko: %lld년
zh_hans: %lld 年
zh_hant: %lld 年

# user_info.birthday
source: Birthday
ko: 出生날짜
zh_hans: 出生日期
zh_hant: 出生日期

# user_posts.delete_confirm_title
source: Confirm Delete
ko: 확인삭제
zh_hans: 确认删除
zh_hant: 確認刪除

# user_posts.delete_post.title
source: Delete Post
ko: 삭제게시물
zh_hans: 删除帖子
zh_hant: 刪除帖子

# weekday.friday
source: Fri
ko: 주五
zh_hans: 周五
zh_hant: 週五

# weekday.monday
source: Mon
ko: 주一
zh_hans: 周一
zh_hant: 週一

# weekday.saturday
source: Sat
ko: 주六
zh_hans: 周六
zh_hant: 週六

# weekday.sunday
source: Sun
ko: 주日
zh_hans: 周日
zh_hant: 週日

# weekday.thursday
source: Thu
ko: 주四
zh_hans: 周四
zh_hant: 週四

# weekday.tuesday
source: Tue
ko: 주二
zh_hans: 周二
zh_hant: 週二

# weekday.wednesday
source: Wed
ko: 주三
zh_hans: 周三
zh_hant: 週三

# app.name
source: EduPal
zh_hans: 龙城学伴
zh_hant: 龍城學伴

# classroom.capacity.format
source: %d people
zh_hans: %d人
zh_hant: %d人

# classroom.empty_rooms.format
source: Empty Classrooms (%d rooms)
zh_hans: 空闲教室 (%d间)
zh_hant: 空閒教室 (%d間)

# classroom.floor.format
source: Floor %d
zh_hans: %d楼
zh_hant: %d樓

# classroom.time_slot.1_2
source: Slot 1-2
zh_hans: 第1-2节
zh_hant: 第1-2节

# classroom.time_slot.3_4
source: Slot 3-4
zh_hans: 第3-4节
zh_hant: 第3-4节

# classroom.time_slot.5_6
source: Slot 5-6
zh_hans: 第5-6节
zh_hant: 第5-6节

# classroom.time_slot.7_8
source: Slot 7-8
zh_hans: 第7-8节
zh_hant: 第7-8节

# classroom.time_slot.9_10
source: Slot 9-10
zh_hans: 第9-10节
zh_hant: 第9-10节

# comment.reply_placeholder
source: Write your reply...
zh_hans: 写下你的回复...
zh_hant: 寫下你的回複...

# course_selection.total_credits
source: Total Credits
zh_hans: 总学分
zh_hant: 總學分

# course.college_english
source: College English
zh_hans: 大学英语
zh_hant: 大學英語

# course.college_physics
source: College Physics
zh_hans: 大学物理
zh_hant: 大學物理

# course.higher_math
source: Advanced Mathematics
zh_hans: 高等数学
zh_hant: 高等數學

# course.linear_algebra
source: Linear Algebra
zh_hans: 线性代数
zh_hant: 线性代數

# course.programming
source: Programming
zh_hans: 程序设计
zh_hant: 程序設計

# electricity.area
source: Area
zh_hans: 校区
zh_hant: 校区

# electricity.building
source: Building
zh_hans: 建筑物
zh_hant: 建筑物

# electricity.delete_message
source: Are you sure to delete configuration "%@"?
zh_hans: 确定要删除配置 "%@" 吗？
zh_hant: 確定要刪除配置 "%@" 吗？

# electricity.display_name
source: Display Name
zh_hans: 显示名称
zh_hant: 顯示名称

# electricity.display_name_placeholder
source: e.g., My Dorm
zh_hans: 例如：我的宿舍
zh_hant: 例如：我的宿舍

# electricity.empty
source: No Electricity Configuration
zh_hans: 暂无电费配置
zh_hant: 暂无電費配置

# electricity.empty_desc
source: Add a dorm configuration to query electricity balance
zh_hans: 添加宿舍配置后即可查询电费余额
zh_hant: 添加宿舍配置后即可查詢電費余额

# electricity.last_update
source: Updated at %@
zh_hans: 更新于 %@
zh_hant: 更新於 %@

# electricity.room_id
source: Room ID
zh_hans: 房间号
zh_hant: 房間號

# electricity.room_info
source: Room Info
zh_hans: 房间信息
zh_hant: 房間信息

# electricity.select_area
source: Select Area
zh_hans: 选择校区
zh_hant: 選擇校区

# electricity.select_building
source: Select Building
zh_hans: 选择建筑物
zh_hant: 選擇建筑物

# error.authentication_failed
source: Authentication failed, please login again
zh_hans: 认证失败，请重新登录
zh_hant: 認證失敗，請重新登錄

# error.network_failed
source: Network connection failed, please check your network
zh_hans: 网络连接失败，请检查网络
zh_hant: 網絡連接失敗，請檢查網絡

# evaluation.comments
source: Comments (Optional)
zh_hans: 评价意见（可选）
zh_hant: 評價意見（可選）

# evaluation.error.credentials_missing
source: Password missing, please login again
zh_hans: 密码丢失，请重新登录
zh_hant: 密碼丟失，請重新登錄

# evaluation.error.submit_failed
source: Failed to submit evaluation: %@
zh_hans: 提交评价失败: %@
zh_hant: 提交評價失敗: %@

# evaluation.evaluate_all
source: One-Click Evaluation
zh_hans: 一键评价
zh_hant: 一鍵評價

# evaluation.feedback
source: Feedback Quality
zh_hans: 反馈质量
zh_hant: 反馈质量

# evaluation.interaction
source: Student Interaction
zh_hans: 师生互动
zh_hant: 師生互動

# evaluation.materials
source: Teaching Materials
zh_hans: 教学资料
zh_hant: 教學资料

# evaluation.overall_score
source: Overall Rating
zh_hans: 总体评分
zh_hant: 總體評分

# evaluation.scoring_items
source: Scoring Items
zh_hans: 评分项目
zh_hant: 評分项目

# evaluation.teaching
source: Teaching Quality
zh_hans: 教学质量
zh_hant: 教學质量

# exam.error.credentials_missing
source: Password missing, please login again
zh_hans: 密码丢失，请重新登录
zh_hant: 密碼丟失，請重新登錄

# exam.error.user_info_missing
source: User information missing, please login again
zh_hans: 用户信息丢失，请重新登录
zh_hant: 用户信息丟失，請重新登錄

# exam.no_exams
source: No exam arrangements for current term
zh_hans: 当前学期还没有考试安排
zh_hant: 當前學期還没有考試安排

# exam.scheduled_count
source: Scheduled
zh_hans: 已安排
zh_hant: 已安排

# exam.show_scheduled_only
source: Show scheduled exams only
zh_hans: 只显示已安排考试
zh_hant: 只顯示已安排考試

# exam.statistics
source: Statistics
zh_hans: 统计
zh_hant: 統計

# exam.unscheduled_count
source: Unscheduled
zh_hans: 未安排
zh_hant: 未安排

# forget.continue
source: Continue
zh_hans: 继续
zh_hant: 繼續

# forget.email_sent
source: Reset Email Sent
zh_hans: 重置邮件已发送
zh_hant: 重置郵件已發送

# forget.email_sent_message
source: Please check your inbox and click the link in the email to reset your password.
zh_hans: 请检查您的邮箱，点击邮件中的链接来重置密码。
zh_hant: 請檢查您的郵箱，點擊郵件中的链接來重置密碼。

# forget.error.missing_auth
source: Authentication information is missing, unable to update password
zh_hans: 认证信息缺失，无法更新密码
zh_hant: 認證信息缺失，无法更新密碼

# forget.error.update_failed
source: Password update failed: %@
zh_hans: 更新密码失败：%@
zh_hant: 更新密碼失敗：%@

# forget.new_password.placeholder
source: New Password
zh_hans: 新密码
zh_hant: 新密碼

# forget.privacy_notice
source: We take your privacy seriously. If you reset your password on another person's device, your personal information will not be saved on that device.
zh_hans: 我们非常重视保护你的隐私。如果你在其他人的设备上重设密码，你的个人信息将不会保存在该设备上。
zh_hant: 我们非常重视保护你的隱私。如果你在其他人的設備上重設密碼，你的个人信息将不会保存在該設備上。

# forget.title
source: Forgot Password?
zh_hans: 忘记密码？
zh_hant: 忘記密碼？

# forget.update_button
source: Update Password
zh_hans: 更新密码
zh_hant: 更新密碼

# gpa.class
source: Class
zh_hans: 班级
zh_hant: 班級

# gpa.error.credentials_missing
source: Password missing, please login again
zh_hans: 密码丢失，请重新登录
zh_hant: 密碼丟失，請重新登錄

# gpa.error.fetch_failed
source: Failed to fetch GPA: %@
zh_hans: 获取学分绩点失败: %@
zh_hant: 獲取學分績點失敗: %@

# gpa.error.user_info_missing
source: User information missing, please login again
zh_hans: 用户信息丢失，请重新登录
zh_hant: 用户信息丟失，請重新登錄

# gpa.level.average
source: Average
zh_hans: 中等
zh_hant: 中等

# gpa.level.excellent
source: Excellent
zh_hans: 优秀
zh_hant: 优秀

# gpa.level.good
source: Good
zh_hans: 良好
zh_hant: 良好

# gpa.level.need_effort
source: Need Effort
zh_hans: 需努力
zh_hant: 需努力

# gpa.level.pass
source: Pass
zh_hans: 及格
zh_hant: 及格

# gpa.level.qualified
source: Qualified
zh_hans: 合格
zh_hant: 合格

# gpa.name
source: Name
zh_hans: 姓名
zh_hant: 姓名

# gpa.no_data
source: No Data
zh_hans: 暂无数据
zh_hant: 暂无數據

# gpa.no_info
source: Unable to retrieve GPA information
zh_hans: 无法获取学分绩点信息
zh_hant: 无法獲取學分績點信息

# gpa.student_info
source: Student Information
zh_hans: 学生信息
zh_hant: 學生信息

# grade.credit
source: %.1f Credits
zh_hans: %.1f学分
zh_hant: %.1f學分

# grade.error.credentials_missing
source: Password missing, please login again
zh_hans: 密码丢失，请重新登录
zh_hant: 密碼丟失，請重新登錄

# grade.error.fetch_failed
source: Failed to fetch grades: %@
zh_hans: 获取成绩失败: %@
zh_hant: 獲取成績失敗: %@

# grade.error.user_info_missing
source: User information missing, please login again
zh_hans: 用户信息丢失，请重新登录
zh_hant: 用户信息丟失，請重新登錄

# grade.gpa
source: GPA: %.1f
zh_hans: 绩点: %.1f
zh_hant: 績點: %.1f

# grade.no_grades_all
source: You don't have any grade records yet
zh_hans: 你还没有任何成绩记录
zh_hant: 你還没有任何成績記錄

# grade.no_grades_term
source: No grades for current term yet
zh_hans: 当前学期还没有成绩记录
zh_hant: 當前學期還没有成績記錄

# grade.score
source: Score: %@
zh_hans: 成绩: %@
zh_hant: 成績: %@

# image.crop.instruction
source: Drag and pinch to adjust the image
zh_hans: 拖动和缩放以调整图片
zh_hant: 拖動和缩放以调整圖片

# image.crop.title
source: Crop Avatar
zh_hans: 裁剪头像
zh_hant: 裁剪頭像

# image.crop.use_original
source: Use Original
zh_hans: 使用原图
zh_hant: 使用原圖

# import_schedule.credentials_missing
source: Password missing, please login again
zh_hans: 密码丢失，请重新登录
zh_hant: 密碼丟失，請重新登錄

# import_schedule.demo_schedule_name
source: Demo Schedule
zh_hans: 示例课表
zh_hant: 示例課表

# import_schedule.demo_term_name
source: Spring 2025 Semester
zh_hans: 2025年春季学期
zh_hant: 2025年春季學期

# import_schedule.server_schedule_name
source: Teaching System Schedule
zh_hans: 教务系统课表
zh_hant: 教務繫統課表

# intent.field.gpa
source: GPA
zh_hans: 绩点
zh_hant: 績點

# location.building_a101
source: Building A101
zh_hans: 教学楼A101
zh_hant: 教學樓A101

# location.building_a205
source: Building A205
zh_hans: 教学楼A205
zh_hant: 教學樓A205

# location.building_b203
source: Foreign Languages Building B203
zh_hans: 外语楼B203
zh_hant: 外語樓B203

# location.building_c301
source: Computer Building C301
zh_hans: 计算机楼C301
zh_hant: 計算机樓C301

# location.building_d102
source: Science Building D102
zh_hans: 理学楼D102
zh_hant: 理學樓D102

# login.error
source: Login failed: %@
zh_hans: 登录失败: %@
zh_hant: 登錄失敗: %@

# login.error.invalid_credentials
source: Invalid username or password, please try again
zh_hans: 账号或密码错误，请检查后重试
zh_hant: 帳號或密碼錯誤，請檢查后重試

# login.error.network
source: Network connection failed, please check your network
zh_hans: 网络连接失败，请检查网络后重试
zh_hant: 網絡連接失敗，請檢查網絡后重試

# login.error.server
source: Server error, please try again later
zh_hans: 服务器异常，请稍后重试
zh_hant: 服務器异常，請稍后重試

# login.error.unknown
source: Login failed: %@
zh_hans: 登录失败：%@
zh_hant: 登錄失敗：%@

# login.password.accessibility
source: Password input field
zh_hans: 密码输入框
zh_hant: 密碼輸入框

# login.username.accessibility
source: Student ID input field
zh_hans: 学号输入框
zh_hant: 學號輸入框

# manage_schedules.current_badge
source: Current
zh_hans: 当前
zh_hant: 當前

# manage_schedules.delete_confirm_message
source: Are you sure you want to delete "%@"? This action cannot be undone.
zh_hans: 确定要删除「%@」吗？此操作不可撤销。
zh_hant: 確定要刪除「%@」吗？此操作不可撤銷。

# manage_schedules.set_active
source: Set as Current
zh_hans: 设为当前
zh_hant: 設為當前

# notice.no_notices
source: No Notices
zh_hans: 暂无通知
zh_hant: 暂无通知

# password.strength.medium
source: Medium
zh_hans: 中
zh_hant: 中

# password.strength.strong
source: Strong
zh_hans: 强
zh_hant: 強

# password.strength.weak
source: Weak
zh_hans: 弱
zh_hant: 弱

# profile_setup.avatar_url
source: Avatar URL (Optional)
zh_hans: 头像URL(可选)
zh_hant: 頭像URL(可選)

# profile_setup.class_name
source: Class
zh_hans: 班级
zh_hant: 班級

# profile_setup.grade
source: Grade (Number)
zh_hans: 年级(数字)
zh_hant: 年級(數字)

# profile_setup.nickname
source: Nickname
zh_hans: 昵称
zh_hant: 昵称

# profile_setup.nickname_section
source: Nickname & Avatar
zh_hans: 昵称与头像
zh_hant: 昵称与頭像

# profile_setup.real_name
source: Full Name
zh_hans: 姓名
zh_hant: 姓名

# profile_setup.student_info
source: Student Information
zh_hans: 学籍信息
zh_hant: 學籍信息

# profile_setup.title
source: Complete Profile
zh_hans: 完善资料
zh_hant: 完善资料

# registration.next_step
source: Next
zh_hans: 下一步
zh_hant: 下一步

# registration.profile.avatar_hint
source: Your avatar and nickname are visible to everyone.
zh_hans: 你的头像和昵称对所有人可见。
zh_hant: 你的頭像和昵称对所有人可見。

# registration.profile.error.nickname_empty
source: Please enter a username
zh_hans: 请输入用户名
zh_hant: 請輸入用户名

# registration.profile.error.no_edu_info
source: Educational system information not found. Please login to the educational system in the "My" page first to obtain student information
zh_hans: 未找到教务系统信息，请先在"我的"页面登录教务系统获取学籍信息
zh_hant: 未找到教務繫統信息，請先在"我的"頁面登錄教務繫統獲取學籍信息

# registration.profile.error.no_user_id
source: Unable to get user ID
zh_hans: 无法获取用户ID
zh_hant: 无法獲取用户ID

# registration.profile.hint
source: You can continue to improve your profile in the personal center later
zh_hans: 稍后可以在个人中心继续完善信息
zh_hant: 稍后可以在个人中心繼續完善信息

# registration.profile.nickname
source: Nickname
zh_hans: 昵称
zh_hant: 昵称

# registration.profile.nickname_placeholder
source: Enter nickname
zh_hans: 输入昵称
zh_hant: 輸入昵称

# registration.profile.title
source: Complete Your Profile
zh_hans: 完善你的个人资料
zh_hant: 完善你的个人资料

# report.error.message
source: Failed to submit report: %@
zh_hans: 举报提交失败：%@
zh_hant: 舉報提交失敗：%@

# report.error.submit_failed
source: Failed to submit report, please try again later
zh_hans: 举报提交失败，请稍后重试
zh_hant: 舉報提交失敗，請稍后重試

# report.reason.ad
source: Spam Advertising
zh_hans: 垃圾广告
zh_hant: 垃圾广告

# report.reason.copyright
source: Copyright Infringement
zh_hans: 侵犯版权
zh_hant: 侵犯版權

# report.reason.details
source: Details
zh_hans: 详细说明
zh_hant: 详細說明

# report.reason.details.placeholder
source: Please describe the reason for reporting
zh_hans: 请描述举报原因
zh_hant: 請描述舉報原因

# report.reason.hate_speech
source: Hate Speech
zh_hans: 仇恨言论
zh_hant: 仇恨言論

# report.reason.label
source: Report Reason
zh_hans: 举报原因
zh_hant: 舉報原因

# report.reason.misinformation
source: Misinformation
zh_hans: 虚假信息
zh_hant: 虚假信息

# report.subtitle
source: Please select the reason for reporting. We will process it as soon as possible.
zh_hans: 请选择举报原因，我们会尽快处理。
zh_hant: 請選擇舉報原因，我们会尽快處理。

# schedule_component.class_unit
source: section
zh_hans: 节
zh_hant: 节

# schedule_component.duration_classes
source: %d classes
zh_hans: %d节课
zh_hant: %d节課

# schedule_component.reschedule
source: Reschedule Class
zh_hans: 调课
zh_hant: 调課

# schedule_component.reschedule_to
source: Reschedule Class to
zh_hans: 调课至
zh_hant: 调課至

# schedule.set_current
source: Set as Current
zh_hans: 设为当前
zh_hant: 設為當前

# settings.background_opacity
source: Background Photo Opacity
zh_hans: 背景照片不透明度
zh_hant: 背景照片不透明度

# settings.logout_confirm_message
source: After logout, you will not be able to access personal information and logged-in features.
zh_hans: 退出登录后，您将无法访问个人信息和已登录的功能。
zh_hant: 退出登錄后，您将无法访问个人信息和已登錄的功能。

# settings.notification_time.1hour
source: 1 hour before
zh_hans: 提前1小时
zh_hant: 提前1小時

# settings.notification_time.15min
source: 15 min before
zh_hans: 提前15分钟
zh_hant: 提前15分钟

# settings.notification_time.30min
source: 30 min before
zh_hans: 提前30分钟
zh_hant: 提前30分钟

# settings.notifications
source: Notifications
zh_hans: 通知
zh_hant: 通知

# settings.show_all_day_events
source: Show All-day Events
zh_hans: 显示全天日程
zh_hant: 顯示全天日程

# settings.show_grid_lines
source: Show Grid Lines
zh_hans: 显示分割线
zh_hant: 顯示分割线

# settings.timeline_display_standard_desc
source: Grid by hours
zh_hans: 按小时绘制网格
zh_hant: 按小時绘製網格

# teacher.prof_qian
source: Prof. Qian
zh_hans: 钱教授
zh_hant: 钱教授

# teacher.prof_wang
source: Prof. Wang
zh_hans: 王教授
zh_hant: 王教授

# teacher.prof_zhang
source: Prof. Zhang
zh_hans: 张教授
zh_hant: 張教授

# teacher.teacher_li
source: Dr. Li
zh_hans: 李老师
zh_hant: 李老師

# teacher.teacher_zhao
source: Dr. Zhao
zh_hans: 赵老师
zh_hant: 赵老師

# teaching_system.closed_for_maintenance
source: The teaching system is currently under maintenance (23:00-6:00). Please try again later.
zh_hans: 教务系统当前处于维护时间（23:00-6:00），请稍后再试。
zh_hant: 教務繫統當前處於维护時間（23:00-6:00），請稍后再試。

# teaching_system.network_unreachable
source: Cannot connect to the teaching system. Please check your network connection.
zh_hans: 无法连接到教务系统，请检查网络连接
zh_hant: 无法連接到教務繫統，請檢查網絡連接

# teaching_system.server_error
source: Teaching system server error. Please try again later.
zh_hans: 教务系统服务器错误，请稍后再试
zh_hant: 教務繫統服務器錯誤，請稍后再試

# teaching_system.service_hours
source: Service Hours: 6:00-23:00
zh_hans: 服务时间：6:00-23:00
zh_hant: 服務時間：6:00-23:00

# teaching_system.system_closed
source: Teaching System Closed
zh_hans: 教务系统已关闭
zh_hant: 教務繫統已關闭

# teaching_system.unavailable_title
source: Teaching System Unavailable
zh_hans: 教务系统不可用
zh_hant: 教務繫統不可用

# time_interval.15min
source: 15 minutes
zh_hans: 15分钟
zh_hant: 15分钟

# time_interval.30min
source: 30 minutes
zh_hans: 30分钟
zh_hant: 30分钟

# time_interval.60min
source: 60 minutes
zh_hans: 60分钟
zh_hant: 60分钟

# training_plan.clear_cache
source: Clear Cache
zh_hans: 清除缓存
zh_hant: 清除緩存

# training_plan.credit_distribution
source: Credit Distribution
zh_hans: 学分分布
zh_hant: 學分分佈

# training_plan.degree
source: Degree
zh_hans: 学位
zh_hant: 學位

# training_plan.duration
source: Duration
zh_hans: 学制
zh_hant: 學製

# training_plan.elective_credits
source: Elective Credits
zh_hans: 选修学分
zh_hant: 選修學分

# training_plan.major
source: Major
zh_hans: 专业
zh_hant: 專業

# training_plan.no_plan
source: No Training Plan
zh_hans: 暂无培养方案
zh_hant: 暂无培养方案

# training_plan.no_plan_desc
source: Training plan not found for your major
zh_hans: 未找到您的专业培养方案
zh_hant: 未找到您的專業培养方案

# training_plan.objectives
source: Training Objectives
zh_hans: 培养目标
zh_hant: 培养目標

# training_plan.practice_credits
source: Practice Credits
zh_hans: 实践学分
zh_hant: 實践學分

# training_plan.required_credits
source: Required Credits
zh_hans: 必修学分
zh_hant: 必修學分

# training_plan.total_credits
source: Total Credits
zh_hans: 总学分
zh_hant: 總學分

# training_plan.type.elective
source: Elective
zh_hans: 选修
zh_hant: 選修

# training_plan.type.practice
source: Practical
zh_hans: 实践
zh_hant: 實践

# training_plan.type.required
source: Required
zh_hans: 必修
zh_hant: 必修

# user_info.academic
source: Academic Information
zh_hans: 学籍信息
zh_hant: 學籍信息

# user_info.basic
source: Basic Information
zh_hans: 基本信息
zh_hant: 基本信息

# user_info.campus
source: Campus
zh_hans: 校区
zh_hant: 校区

# user_info.campus_info
source: Campus Information
zh_hans: 校区信息
zh_hant: 校区信息

# user_info.class
source: Class
zh_hans: 班级
zh_hant: 班級

# user_info.dormitory
source: Dormitory
zh_hans: 宿舍
zh_hant: 宿舍

# user_info.error.fetch_failed
source: Failed to fetch user info: %@
zh_hans: 获取用户信息失败: %@
zh_hant: 獲取用户信息失敗: %@

# user_info.gender
source: Gender
zh_hans: 性别
zh_hant: 性別

# user_info.grade
source: Grade
zh_hans: 年级
zh_hant: 年級

# user_info.major
source: Major
zh_hans: 专业
zh_hant: 專業

# user_info.phone
source: Phone
zh_hans: 手机号
zh_hant: 手机號

# user_info.status
source: Status
zh_hans: 学籍状态
zh_hant: 學籍狀態

# user_info.study_length
source: Study Length
zh_hans: 学制
zh_hant: 學製

# user_posts.delete_comment_confirm_message
source: Are you sure you want to delete all your comments on this post? This action cannot be undone.
zh_hans: 确定要删除你在该帖下的所有评论吗？此操作不可撤销。
zh_hant: 確定要刪除你在該帖下的所有評論吗？此操作不可撤銷。

# user_posts.delete_comment.message
source: Are you sure you want to delete all your comments under this post? This action cannot be undone.
zh_hans: 确定要删除你在该帖下的所有评论吗？此操作不可撤销。
zh_hant: 確定要刪除你在該帖下的所有評論吗？此操作不可撤銷。

# user_posts.delete_confirm_message
source: Are you sure you want to delete the post "%@"? This action cannot be undone.
zh_hans: 确定要删除帖子"%@"吗？此操作不可撤销。
zh_hant: 確定要刪除帖子"%@"吗？此操作不可撤銷。

# user_posts.delete_confirm_message_generic
source: Are you sure you want to delete this post? This action cannot be undone.
zh_hans: 确定要删除这篇帖子吗？删除后无法恢复。
zh_hant: 確定要刪除这篇帖子吗？刪除后无法恢複。

# user_posts.delete_post.message
source: Are you sure you want to delete this post? This action cannot be undone.
zh_hans: 确定要删除这篇帖子吗？删除后无法恢复。
zh_hant: 確定要刪除这篇帖子吗？刪除后无法恢複。
